src/doc/createPolicy-temp.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns7:createPolicyRequest xmlns:ns7="http://toi.ru/esb/model/serviceMessagesExt"
                                 xmlns:ns6="http://toi.ru/model/gw/quote" xmlns:ns5="http://toi.ru/esb/model/gw/policy"
                                 xmlns:ns4="http://toi.ru/model/gw/client" xmlns:ns3="http://toi.ru/model/productinfo"
                                 xmlns:ns2="http://toi.ru/model/productinfo/servicemessage">
            <ns7:Header>
                <user>telegram</user>
                <password>qIQqu873KE</password>
            </ns7:Header>
            <ns7:ProductName>PartnerTravelV2Box</ns7:ProductName>
            <ns7:ProductOptions>
                <ns3:Option>
                    <ns3:Code>QuoteRequest</ns3:Code>
                    <ns3:ValueInfo>
                        <ns3:Code>AssistanceLevel</ns3:Code>
                        <ns3:Value>Basic</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>Area</ns3:Code>
                        <ns3:Value>asia</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantityChildren</ns3:Code>
                        <ns3:Value>0</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantityAdults</ns3:Code>
                        <ns3:Value>1</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantitySeniors</ns3:Code>
                        <ns3:Value>0</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>Currency</ns3:Code>
                        <ns3:Value>eur</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:Option>
                        <ns3:Code>Coverages</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>TravelMedicine</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>TravelMedicineLimit</ns3:Code>
                                <ns3:Value>30000</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                        <ns3:Option>
                            <ns3:Code>TripOptions</ns3:Code>
                        </ns3:Option>
                    </ns3:Option>
                    <ns3:Option>
                        <ns3:Code>LeisureType</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>ActiveLeisure</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>isActiveLeasure</ns3:Code>
                                <ns3:Value>true</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                    </ns3:Option>
                    <ns3:Option>
                        <ns3:Code>TripDuration</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>SingleTrip</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>TripStartDate</ns3:Code>
                                <ns3:Value>2016-03-19T00:00:00+03:00</ns3:Value>
                            </ns3:ValueInfo>
                            <ns3:ValueInfo>
                                <ns3:Code>TripEndDate</ns3:Code>
                                <ns3:Value>2016-04-04T00:00:00+03:00</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                    </ns3:Option>
                </ns3:Option>
            </ns7:ProductOptions>
            <ns7:ClientInfo>
                <ns4:AccountRole>primaryinsured</ns4:AccountRole>
                <ns4:AccountType>Personal</ns4:AccountType>
                <ns4:LastName>Маятников</ns4:LastName>
                <ns4:LastNameEng>MAYATNIKOV</ns4:LastNameEng>
                <ns4:FirstName>Виталий</ns4:FirstName>
                <ns4:FirstNameEng>VITALII</ns4:FirstNameEng>
                <ns4:MiddleName>Николаевич</ns4:MiddleName>
                <ns4:Birthdate>1955-01-12+03:00</ns4:Birthdate>
                <ns4:Email>mayatnikov@gmail.com</ns4:Email>
                <ns4:MobilePhone>79165894332</ns4:MobilePhone>
                <ns4:Gender>male</ns4:Gender>
                <ns4:TypePrimaryPhone>MOBILE_MAIN</ns4:TypePrimaryPhone>
                <ns4:Document>
                    <ns4:DocumentType>EXT_PASSPORT_RUS</ns4:DocumentType>
                    <ns4:Series>9</ns4:Series>
                    <ns4:Number>87787655</ns4:Number>
                    <ns4:IsActive>true</ns4:IsActive>
                </ns4:Document>
            </ns7:ClientInfo>
<!--
            <ns7:ClientInfo>
                <ns4:AccountRole>primaryinsured</ns4:AccountRole>
                <ns4:AccountType>Personal</ns4:AccountType>
                <ns4:LastName>Маятников</ns4:LastName>
                <ns4:LastNameEng>MAYATNIKOV</ns4:LastNameEng>
                <ns4:FirstName>Виталий</ns4:FirstName>
                <ns4:FirstNameEng>VITALY</ns4:FirstNameEng>
                <ns4:MiddleName>Николаевич</ns4:MiddleName>
                <ns4:Birthdate>1955-12-01</ns4:Birthdate>
                <ns4:Email>mayatnikov@gmail.com</ns4:Email>
                <ns4:MobilePhone>79165894332</ns4:MobilePhone>
                <ns4:Gender>male</ns4:Gender>
                <ns4:TypePrimaryPhone>MOBILE_MAIN</ns4:TypePrimaryPhone>
                <ns4:Document>
                    <ns4:DocumentType>EXT_PASSPORT_RUS</ns4:DocumentType>
                    <ns4:Series>12</ns4:Series>
                    <ns4:Number>3456789</ns4:Number>
                    <ns4:IsActive>true</ns4:IsActive>
                </ns4:Document>
            </ns7:ClientInfo>
-->


            <ns7:DeliveryMethod>Email</ns7:DeliveryMethod>
            <ns7:PaymentMethod>NONE</ns7:PaymentMethod>
        </ns7:createPolicyRequest>
    </S:Body>
</S:Envelope>

